ShellAlbert/PLL_FM_HW/FlashLight/code/Application/board_gd32f303rgt6.c
	gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_4); //PC4:UP_SW
	gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_5); //PC5:DOWN_SW
	gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_8); //PC8:SHOT_SW2
	gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_9); //PC9:SHOT_SW1
	gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_13); //PC13:LASER_MODE2

	//key will be connected to EXTI line with interrupt.

	/* connect key EXTI line to key GPIO pin */
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOA, GPIO_PIN_SOURCE_0);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOA, GPIO_PIN_SOURCE_1);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOA, GPIO_PIN_SOURCE_6);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOA, GPIO_PIN_SOURCE_7);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOA, GPIO_PIN_SOURCE_8);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOA, GPIO_PIN_SOURCE_11);

	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOB, GPIO_PIN_SOURCE_0);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOB, GPIO_PIN_SOURCE_1);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOB, GPIO_PIN_SOURCE_4);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOB, GPIO_PIN_SOURCE_5);

	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_4);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_5);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_8);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_9);
	gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_13);

	nvic_priority_group_set(NVIC_PRIGROUP_PRE2_SUB2);

	/* enable and set key EXTI interrupt to the lowest priority */
	nvic_irq_enable(EXTI0_IRQn, 2U, 0U);
	nvic_irq_enable(EXTI1_IRQn, 2U, 0U);
	nvic_irq_enable(EXTI4_IRQn, 2U, 0U);
	nvic_irq_enable(EXTI5_9_IRQn, 2U, 0U);
	nvic_irq_enable(EXTI10_15_IRQn, 2U, 0U);


	/* configure key EXTI line */
	//Y=~A in schematic,so here is rising edge.
	exti_init(EXTI_0, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_1, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_4, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_5, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_6, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_7, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_8, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_9, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_11, EXTI_INTERRUPT, EXTI_TRIG_RISING);
	exti_init(EXTI_13, EXTI_INTERRUPT, EXTI_TRIG_RISING);

	exti_interrupt_flag_clear(EXTI_0);
	exti_interrupt_flag_clear(EXTI_1);
	exti_interrupt_flag_clear(EXTI_4);
	exti_interrupt_flag_clear(EXTI_5);
	exti_interrupt_flag_clear(EXTI_6);
	exti_interrupt_flag_clear(EXTI_7);
	exti_interrupt_flag_clear(EXTI_8);
	exti_interrupt_flag_clear(EXTI_9);
	exti_interrupt_flag_clear(EXTI_11);
	exti_interrupt_flag_clear(EXTI_13);


}


//USART0: For Debug TTL-USB. (3.3V TTL Level)
static void zusart0_debug_init(void)
{
	//USART0_TX:PA9,USART0_RX:PA10

	/* USART0 interrupt configuration */
	nvic_irq_enable(USART0_IRQn, 0, 0);

	/* enable GPIO clock */
	rcu_periph_clock_enable(RCU_GPIOA);

	/* enable USART clock */
	rcu_periph_clock_enable(RCU_USART0);

	/* connect port to USARTx_Tx & USARTx_Rx*/
	gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_9);
	gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_10);

	/* USART0 configure */
	usart_deinit(USART0);
	usart_baudrate_set(USART0, 115200U);
	usart_receive_config(USART0, USART_RECEIVE_ENABLE);
	usart_transmit_config(USART0, USART_TRANSMIT_ENABLE);
	usart_enable(USART0);
}


//USART1: To communicate with Laser Distance Module. (RS422,Full duplex)
static void zusart1_distance_init(void)
{
	//USART1_TX:PA2,USART1_RX:PA3

	/* enable GPIO clock */
	rcu_periph_clock_enable(RCU_GPIOA);

	/* enable USART clock */
	rcu_periph_clock_enable(RCU_USART1);

	/* connect port to USARTx_Tx & USARTx_Rx*/
	gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_2);
	gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_3);

	/* USART1 configure */
	usart_deinit(USART1);
	usart_baudrate_set(USART1, 115200U);
	usart_receive_config(USART1, USART_RECEIVE_ENABLE);
	usart_transmit_config(USART1, USART_TRANSMIT_ENABLE);
	usart_enable(USART1);
}


//USART2: To communicate with Display module. (3.3V TTL Level)
static void zusart2_oled_init(void)
{
	//USART2_TX:PB10,USART2_RX:PB11

	/* enable GPIO clock */
	rcu_periph_clock_enable(RCU_GPIOB);

	/* enable USART clock */
	rcu_periph_clock_enable(RCU_USART2);

	/* connect port to USARTx_Tx & USARTx_Rx*/
	gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_10);
	gpio_init(GPIOB, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_11);

	/* USART2 configure */
	usart_deinit(USART2);
	usart_baudrate_set(USART2, 115200U);
	usart_receive_config(USART2, USART_RECEIVE_ENABLE);
	usart_transmit_config(USART2, USART_TRANSMIT_ENABLE);
	usart_enable(USART2);
}


//UART3: To communicate with WiFi-UART module. (3.3V TTL Level)
static void zuart3_wifi_init(void)
{
	//UART3_TX:PC10,UART3_RX:PC11

	/* enable GPIO clock */
	rcu_periph_clock_enable(RCU_GPIOC);

	/* enable USART clock */
	rcu_periph_clock_enable(RCU_UART3);

	/* connect port to USARTx_Tx & USARTx_Rx*/
	gpio_init(GPIOC, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_10);
	gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_11);

	/* UART3 configure */
	usart_deinit(UART3);
	usart_baudrate_set(UART3, 115200U);
	usart_receive_config(UART3, USART_RECEIVE_ENABLE);
	usart_transmit_config(UART3, USART_TRANSMIT_ENABLE);
	usart_enable(UART3);
}


//UART4: To communicate with Laser Module. (3.3V TTL Level)
static void zuart4_laser_init(void)
{
	//UART4_TX:PC12,UART4_RX:PD2

	/* enable GPIO clock */
	rcu_periph_clock_enable(RCU_GPIOC);
	rcu_periph_clock_enable(RCU_GPIOD);

	/* enable USART clock */
	rcu_periph_clock_enable(RCU_UART4);

	/* connect port to USARTx_Tx & USARTx_Rx*/
	gpio_init(GPIOC, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_12);
	gpio_init(GPIOD, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_2);

	/* UART4 configure */
	usart_deinit(UART4);
	usart_baudrate_set(UART4, 115200U);
	usart_receive_config(UART4, USART_RECEIVE_ENABLE);
	usart_transmit_config(UART4, USART_TRANSMIT_ENABLE);
	usart_enable(UART4);
}


//MCU SoC ADC0.
//use Timer1 to trigger ADC0 periodic conversation (DMA0-CH0).
//ADC012_IN13:PC0
//ADC012_IN12:PC1
//ADC012_IN11:PC2
//ADC012_IN10:PC3
static void zmcu_soc_adc0_init(void)
{
	timer_oc_parameter_struct timer_ocintpara;
	timer_parameter_struct timer_initpara;

	dma_parameter_struct dma_data_parameter;

	/* enable GPIOA clock */
	rcu_periph_clock_enable(RCU_GPIOC);

