ShellAlbert/PLL_FM_HW/FlashLight/code/Application/board_gd32f303rgt6.c
	/* enable ADC0 clock */
	rcu_periph_clock_enable(RCU_ADC0);

	/* enable DMA0 clock */
	rcu_periph_clock_enable(RCU_DMA0);

	/* enable timer1 clock */
	rcu_periph_clock_enable(RCU_TIMER1);

	/* config ADC clock */
	rcu_adc_clock_config(RCU_CKADC_CKAPB2_DIV4);

	/* config the GPIO as analog mode */
	//ADC012_IN13:PC0
	//ADC012_IN12:PC1
	//ADC012_IN11:PC2
	//ADC012_IN10:PC3
	gpio_init(GPIOC, GPIO_MODE_AIN, GPIO_OSPEED_MAX, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);

	//configure the TIMER peripheral

	/* TIMER1 configuration */
	timer_initpara.prescaler = 48000 - 1;			//IRC 120M/48000=2500Hz.Prescale maximum is 65536.
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = 1250 - 1;				//2500/1250=2Hz
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER1, &timer_initpara);

	/* CH0 configuration in PWM mode1 */
	timer_ocintpara.ocpolarity = TIMER_OC_POLARITY_HIGH;
	timer_ocintpara.outputstate = TIMER_CCX_ENABLE;
	timer_channel_output_config(TIMER1, TIMER_CH_1, &timer_ocintpara);

	//here we set 500(because previous we set period=1250-1)
	//so here is trigger periodly.
	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, 500);
	timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_PWM0);
	timer_channel_output_shadow_config(TIMER1, TIMER_CH_1, TIMER_OC_SHADOW_DISABLE);
	timer_auto_reload_shadow_enable(TIMER1);


	//configure the DMA peripheral

	/* ADC DMA_channel configuration */
	dma_deinit(DMA0, DMA_CH0);

	/* initialize DMA data mode */
	dma_data_parameter.periph_addr = (uint32_t) (&ADC_RDATA(ADC0));
	dma_data_parameter.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
	dma_data_parameter.memory_addr = (uint32_t) (&gBrdFlashLight.iMCUADC);
	dma_data_parameter.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
	dma_data_parameter.periph_width = DMA_PERIPHERAL_WIDTH_32BIT;
	dma_data_parameter.memory_width = DMA_MEMORY_WIDTH_32BIT;
	dma_data_parameter.direction = DMA_PERIPHERAL_TO_MEMORY;
	dma_data_parameter.number = 4 * 50; 			//4 channels,each channels samples 50 times.
	dma_data_parameter.priority = DMA_PRIORITY_HIGH;
	dma_init(DMA0, DMA_CH0, &dma_data_parameter);

	dma_circulation_enable(DMA0, DMA_CH0);
	nvic_irq_enable(DMA0_Channel0_IRQn, 0, 0);

	/* enable DMA transfer complete interrupt */
	dma_interrupt_enable(DMA0, DMA_CH0, DMA_INT_FTF);

	/* enable DMA channel */
	dma_channel_enable(DMA0, DMA_CH0);


	//configure the ADC peripheral

	/* ADC continous function enable */
	adc_special_function_config(ADC0, ADC_SCAN_MODE, ENABLE);
	adc_special_function_config(ADC0, ADC_CONTINUOUS_MODE, ENABLE);

	/* ADC trigger config */
	adc_external_trigger_source_config(ADC0, ADC_REGULAR_CHANNEL, ADC0_1_EXTTRIG_REGULAR_T1_CH1);

	/* ADC data alignment config */
	adc_data_alignment_config(ADC0, ADC_DATAALIGN_RIGHT);
	adc_resolution_config(ADC0, ADC_RESOLUTION_12B);

	/* ADC mode config */
	adc_mode_config(ADC_DAUL_REGULAL_PARALLEL);

	/* ADC channel length config */
	adc_channel_length_config(ADC0, ADC_REGULAR_CHANNEL, 4);

	/* ADC regular channel config */
	adc_regular_channel_config(ADC0, 0, ADC_CHANNEL_10, ADC_SAMPLETIME_55POINT5); //VDD12_MOTOR
	adc_regular_channel_config(ADC0, 1, ADC_CHANNEL_11, ADC_SAMPLETIME_55POINT5); //VSYS
	adc_regular_channel_config(ADC0, 2, ADC_CHANNEL_12, ADC_SAMPLETIME_55POINT5); //Motor1#Current
	adc_regular_channel_config(ADC0, 3, ADC_CHANNEL_13, ADC_SAMPLETIME_55POINT5); //Motor2#Current

	/* ADC external trigger enable */
	adc_external_trigger_config(ADC0, ADC_REGULAR_CHANNEL, ENABLE);

	/* enable ADC interface */
	adc_enable(ADC0);
	delay_1ms(1);

	/* ADC calibration and reset calibration */
	adc_calibration_enable(ADC0);

	/* ADC DMA function enable */
	adc_dma_mode_enable(ADC0);

	/* enable TIMER1 */
	timer_enable(TIMER1);

}


//use Timer2 to schedule Tasks.
static void ztimer2_schedule_task_init(void)
{
	/* ---------------------------------------------------------------
		TIMER2 Configuration: 
		TIMER2CLK = SystemCoreClock / 1200 = 100KHz,
		1/100Hz=0.01s=10ms
		--------------------------------------------------------------- */
	timer_oc_parameter_struct timer_ocintpara;
	timer_parameter_struct timer_initpara;

	rcu_periph_clock_enable(RCU_TIMER2);

	timer_deinit(TIMER2);

	/* TIMER2 configuration */
	timer_initpara.prescaler = 1200 - 1;			//IRC 120M/1200=100KHz.Prescale maximum is 65536.
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = 1000 - 1;				//100KHz/1000=100Hz,1/100Hz=0.01s=10mS
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER2, &timer_initpara);

	//close TIME2_CH0/CH1 to release PB4/PB5 pins.

	/* CH0 and CH1 configuration in PWM mode */
	timer_ocintpara.outputstate = TIMER_CCX_DISABLE;
	timer_ocintpara.outputnstate = TIMER_CCXN_DISABLE;
	timer_ocintpara.ocpolarity = TIMER_OC_POLARITY_LOW;
	timer_ocintpara.ocnpolarity = TIMER_OCN_POLARITY_LOW;
	timer_ocintpara.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
	timer_ocintpara.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;

	timer_channel_output_config(TIMER2, TIMER_CH_0, &timer_ocintpara);
	timer_channel_output_config(TIMER2, TIMER_CH_1, &timer_ocintpara);


	/* auto-reload preload enable */
	timer_auto_reload_shadow_enable(TIMER2);
	timer_interrupt_flag_clear(TIMER2, TIMER_INT_FLAG_UP);

	/*interrupt enable */
	timer_interrupt_enable(TIMER2, TIMER_INT_UP);
	nvic_irq_enable(TIMER2_IRQn, 2U, 0U);
	timer_enable(TIMER2);

}


//Timer3 to output pwm to drive brush DC motor.
extern void ztimer3_bdcm_init(void)
{
	timer_oc_parameter_struct timer_ocintpara;
	timer_parameter_struct timer_initpara;

	//Configure the GPIO ports.
	rcu_periph_clock_enable(RCU_GPIOB);
	rcu_periph_clock_enable(RCU_AF);

	//Configure PB6 PB7(TIMER3 CH0 CH1) as alternate function.
	gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);
	gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);

	//Configure the TIMER peripheral.

	/* -----------------------------------------------------------------------
	TIMER3 configuration: generate 2 PWM signals with 2 different duty cycles:
	TIMER3CLK = SystemCoreClock / 120 = 1MHz

	TIMER3 channel0 duty cycle = (5/ 10(period))* 100  = 50%
	TIMER3 channel1 duty cycle = (2/ 10(period))* 100  = 20%
	----------------------------------------------------------------------- */
	rcu_periph_clock_enable(RCU_TIMER3);

