ShellAlbert/PLL_FM_HW/FlashLight/code/Application/board_gd32f303rgt6.c
	timer_deinit(TIMER3);

	/* TIMER1 configuration */
	timer_initpara.prescaler = 120 - 1; 			//IRC 120M/120=1MHz.Prescale maximum is 65536.
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = 10 - 1; 				//1MHz/10=100kHz
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER3, &timer_initpara);

	/* CH0 and CH1 configuration in PWM mode */
	timer_ocintpara.outputstate = TIMER_CCX_ENABLE;
	timer_ocintpara.outputnstate = TIMER_CCXN_DISABLE;
	timer_ocintpara.ocpolarity = TIMER_OC_POLARITY_LOW;
	timer_ocintpara.ocnpolarity = TIMER_OCN_POLARITY_LOW;
	timer_ocintpara.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
	timer_ocintpara.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;

	timer_channel_output_config(TIMER3, TIMER_CH_0, &timer_ocintpara);
	timer_channel_output_config(TIMER3, TIMER_CH_1, &timer_ocintpara);

	/* CH0 configuration in PWM mode0,duty cycle 25% */
	//timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_0, 40); //period/pwm=100/40=25%
	//set PWM to 0 to close channel output.
	timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_0, 10); //period/pwm=100/100=0%


	timer_channel_output_mode_config(TIMER3, TIMER_CH_0, TIMER_OC_MODE_PWM0);
	timer_channel_output_shadow_config(TIMER3, TIMER_CH_0, TIMER_OC_SHADOW_DISABLE);

	/* CH1 configuration in PWM mode0,duty cycle 50% */
	timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_1, 2); //period/pwm=100/50=50%

	//set PWM to 0 to close channel output.
	//timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_1, 100);//period/pwm=100/100=0%
	timer_channel_output_mode_config(TIMER3, TIMER_CH_1, TIMER_OC_MODE_PWM0);
	timer_channel_output_shadow_config(TIMER3, TIMER_CH_1, TIMER_OC_SHADOW_DISABLE);

	/* auto-reload preload enable */
	timer_auto_reload_shadow_enable(TIMER3);

	/* auto-reload preload enable */
	timer_enable(TIMER3);
}


//Timer4 to flash LED.
static void ztimer4_led_init(void)
{
	timer_oc_parameter_struct timer_ocintpara;
	timer_parameter_struct timer_initpara;

	//Configure the TIMER peripheral.

	/* -----------------------------------------------------------------------
	TIMER4 configuration: generate 2 PWM signals with 2 different duty cycles:
	TIMER4CLK = SystemCoreClock / 120 = 1MHz

	TIMER4 channel0 duty cycle = (5/ 10(period))* 100  = 50%
	TIMER4 channel1 duty cycle = (2/ 10(period))* 100  = 20%
	----------------------------------------------------------------------- */
	rcu_periph_clock_enable(RCU_TIMER4);

	timer_deinit(TIMER4);

	/* TIMER1 configuration */
	timer_initpara.prescaler = 48000 - 1;			//IRC 120M/48000=2500Hz.Prescale maximum is 65536.
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = 1250 - 1;				//2500/1250=2Hz
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER4, &timer_initpara);

	/* auto-reload preload enable */
	timer_auto_reload_shadow_enable(TIMER4);
	timer_interrupt_flag_clear(TIMER4, TIMER_INT_FLAG_UP);

	/*interrupt enable */
	timer_interrupt_enable(TIMER4, TIMER_INT_UP);
	nvic_irq_enable(TIMER4_IRQn, 2U, 0U);
	timer_enable(TIMER4);
}


//Timer7 to output pwm to drive brush DC motor.
extern void ztimer7_bdcm_init(void)
{
	timer_oc_parameter_struct timer_ocintpara;
	timer_parameter_struct timer_initpara;

	//Configure the GPIO ports.
	rcu_periph_clock_enable(RCU_GPIOC);
	rcu_periph_clock_enable(RCU_AF);

	//Configure PC6 PC7(TIMER7 CH0 CH1) as alternate function.
	gpio_init(GPIOC, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);
	gpio_init(GPIOC, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);

	//Configure the TIMER peripheral.

	/* -----------------------------------------------------------------------
	TIMER7 configuration: generate 2 PWM signals with 2 different duty cycles:
	TIMER7CLK = SystemCoreClock / 120 = 1MHz

	TIMER7 channel0 duty cycle = (4000/ 16000)* 100  = 25%
	TIMER7 channel1 duty cycle = (8000/ 16000)* 100  = 50%
	----------------------------------------------------------------------- */
	rcu_periph_clock_enable(RCU_TIMER7);

	timer_deinit(TIMER7);

	/* TIMER1 configuration */
	timer_initpara.prescaler = 120 - 1; 			//IRC 120M/120=1MHz.Prescale maximum is 65536.
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = 10 - 1; 				//1MHz/10=100kHz
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER7, &timer_initpara);

	/* CH0 and CH1 configuration in PWM mode */
	timer_ocintpara.outputstate = TIMER_CCX_ENABLE;
	timer_ocintpara.outputnstate = TIMER_CCXN_DISABLE;
	timer_ocintpara.ocpolarity = TIMER_OC_POLARITY_LOW;
	timer_ocintpara.ocnpolarity = TIMER_OCN_POLARITY_LOW;
	timer_ocintpara.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
	timer_ocintpara.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;

	timer_channel_output_config(TIMER7, TIMER_CH_0, &timer_ocintpara);
	timer_channel_output_config(TIMER7, TIMER_CH_1, &timer_ocintpara);

	/* CH0 configuration in PWM mode0,duty cycle 25% */
	timer_channel_output_pulse_value_config(TIMER7, TIMER_CH_0, 2); //period/pwm=10/5=50%

	//set PWM to 0 to close channel output.
	//timer_channel_output_pulse_value_config(TIMER7, TIMER_CH_0, 10);//period/pwm=100/100=0%
	timer_channel_output_mode_config(TIMER7, TIMER_CH_0, TIMER_OC_MODE_PWM0);
	timer_channel_output_shadow_config(TIMER7, TIMER_CH_0, TIMER_OC_SHADOW_DISABLE);

	/* CH1 configuration in PWM mode0,duty cycle 50% */
	//timer_channel_output_pulse_value_config(TIMER7, TIMER_CH_1, 5);//period/pwm=10/5=50%
	//set PWM to 0 to close channel output.
	timer_channel_output_pulse_value_config(TIMER7, TIMER_CH_1, 10); //period/pwm=10/10=0%
	timer_channel_output_mode_config(TIMER7, TIMER_CH_1, TIMER_OC_MODE_PWM0);
	timer_channel_output_shadow_config(TIMER7, TIMER_CH_1, TIMER_OC_SHADOW_DISABLE);

	/* auto-reload preload enable */
	timer_auto_reload_shadow_enable(TIMER7);

	/*TIMER7 primary output function enable Only Advanced Timer0 and Timer7 needed.*/
	timer_primary_output_config(TIMER7, ENABLE);

