ShellAlbert/PLL_FM_HW/FlashLight/code/Application/board_gd32f303rgt6.c
	/* auto-reload preload enable */
	timer_enable(TIMER7);
}


//integrates all low-level components initialization.
void zboard_low_init(void)
{


	//configure the TIMER peripheral
	timer_oc_parameter_struct timer_ocintpara;
	timer_parameter_struct timer_initpara;

	//configure the DMA peripheral
	dma_parameter_struct dma_data_parameter;

	//first initial global variables.
	gBrdFlashLight.sUsart0.fsm = FSM_PREPARE;

	//LED1/2 to indicate system working status.
	zled12_init();
#if 0

	//initial all Keys to EXTI mode.
	zkeys_exti_init();

	//use Timer4 to driver LED in 1Hz.
	ztimer4_led_init();

	//Timer7 to output pwm to drive brush DC motor.
	//ztimer7_bdcm_init();
	//USART0: For Debug TTL-USB. (3.3V TTL Level)
	zusart0_debug_init();

	//USART1: To communicate with Laser Distance Module. (RS422,Full duplex)
	//zusart1_distance_init();
	//USART2: To communicate with Display module. (3.3V TTL Level)
	//zusart2_oled_init();
	//UART3: To communicate with WiFi-UART module. (3.3V TTL Level)
	//zuart3_wifi_init();
	//UART4: To communicate with Laser Module. (3.3V TTL Level)
	//zuart4_laser_init();
	//MCU SoC ADC0.
	//use Timer1 to trigger ADC0 periodic conversation (DMA0-CH0).
	zmcu_soc_adc0_init();

	//use Timer2 to generate 10mS to schedule all Tasks.
	ztimer2_schedule_task_init();

	//Timer3 to output pwm to drive brush DC motor.
	//ztimer3_bdcm_init();
#endif
}


void zled_on_off(uint8_t iLed, uint8_t iOn)
{
	switch (iLed)
	{
		case 1:
			(iOn == 1) ? (GPIO_BC(GPIOB) = GPIO_PIN_3): (GPIO_BOP(GPIOB) = GPIO_PIN_3);
			break;
		default:
			break;
	}
}


void zled_toggle(uint8_t iLed)
{
	switch (iLed)
	{
		case 1:
			gpio_bit_write(GPIOB, GPIO_PIN_3, (bit_status) (1 - gpio_input_bit_get(GPIOB, GPIO_PIN_3)));
			break;
		default:
			break;
	}

}


/* retarget the C library printf function to the USART */
int fputc(int ch, FILE * f)
{
#if 1
	usart_data_transmit(USART0, (uint8_t) ch);

	while (RESET == usart_flag_get(USART0, USART_FLAG_TBE))
		;

#endif
}


